[
  {
    "titulo": "Web Developer",
    "subtitulo": "Exiti Digital Solutions",
    "periodo": "08/2022 - 09/2024",
    "localidade": "Ilha Solteira, Brazil",
    "descricao": "Developer of custom software, web and mobile applications for companies in general.",
    "tarefas": [
      "Develop and maintain web applications in Java ServerFaces, microservices in Node.js with Express and in Spring, mainly using Spring Boot, Spring Security, and Spring Data JPA, using Spring Cloud Gateway and Eureka for service discovery, web applications in ReactJs and NextJs.",
      "Write Dockerfiles and host on Azure platform.",
      "Maintain PostgreSQL databases. Create and maintain functions in PL/pgSQL.",
      "Create and maintain continuous integration and continuous delivery routines with BitBucket Pipeline.",
      "Apply Clean Code practices focusing on SOLID and Design Patterns. Using lint tools such as ESLint and SonarLint."
    ]
  },
  {
    "titulo": "Tech Lead",
    "subtitulo": "Exiti Digital Solutions",
    "periodo": "01/2024 – 06/2024",
    "localidade": "Ilha Solteira, Brazil",
    "descricao": "Developer of custom software, web and mobile applications for companies in general.",
    "tarefas": [
      "Responsible for organizing Sprints, as well as planning meetings, daily meetings, and One-on-One meetings.",
      "Analyze quality, approve, and merge team Pull Requests.",
      "Along with the responsibilities of the Web Developer position."
    ]
  },
  {
    "titulo": "Systems Analyst",
    "subtitulo": "Ceres Sistemas",
    "periodo": "10/2020 - 03/2022",
    "localidade": "Pereira Barreto, Brazil",
    "descricao": "Automation of chemical laboratories and agriculture.",
    "tarefas": [
      "Develop and maintain web applications in Java Server Faces and web services in JAX-RS hosted on AWS EC2.",
      "Maintain PostgreSQL databases hosted on AWS RDS.",
      "Provide support and maintain desktop applications in Java Swing."
    ]
  },
  {
    "titulo": "IT Technician",
    "subtitulo": "Ceres Sistemas",
    "periodo": "01/2019 - 10/2020",
    "localidade": "Pereira Barreto, Brazil",
    "descricao": "Automation of chemical laboratories and agriculture.",
    "tarefas": [
      "Develop and maintain web applications in Java Server Faces, hosted on AWS EC2.",
      "Maintain PostgreSQL databases hosted on AWS RDS.",
      "Provide support and maintain desktop applications in Java Swing."
    ]
  }
]
